<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>L'Art de la programmation scientifique :: FAQ</title>
  <meta name="Keywords"
 content="N-body code, N-body problem, N-body simulations,
amateur astronomy, open source, science, star clusters,
Ruby, Ruby code">
</head>
<body
 style="color: rgb(0, 0, 0); background-color: rgb(238, 255, 238); background-image: url();"
 link="#0000cc" alink="#cccccc" vlink="#000099">
<table nosave="" cellpadding="5" cellspacing="2" width="100%">
  <tbody>
    <tr nosave="" valign="top">
      <td nosave="" align="center">
      <img src="../../../img/acstitle-s2.gif"></td>
      <td nosave="">
      <center>
      <h1>L'Art de la
programmation scientifique
      </h1>
      </center>
      <hr>
      <center>
      <h3>Foire Aux Questions
      </h3>
      </center>
      <hr>
      <br>
      </td>
      <td nosave="" align="center">
      <img src="../../../img/acstitle-s2rot.gif"></td>
    </tr>
  </tbody>
</table>
<table cellpadding="5" width="100%">
  <tbody>
    <tr>
      <td align="left">
&copy; 2003-2005 <a href="http://www.ids.ias.edu/%7Epiet/">Piet Hut</a>
et
      <a href="http://jun.artcompsci.org">Jun
Makino</a>
      </td>
      <td>
      </td>
      <td align="right">
Retour &agrave; la <a href="../index.html">page d'accueil</a>
      </td>
    </tr>
  </tbody>
</table>
<hr>
Quelques questions fr&eacute;quemment pos&eacute;es :
<ul>
  <li>
    <a href="#goal">Quel
est le but du projet ACS ?</a></li>
  <li><a href="#play">Comment peut-on jouer avec un code
N-corps ?</a></li>
  <li><a href="#use">Pourquoi utiliser le langage Ruby ?</a>
  </li>
  <li><a href="#fast">Le langage Ruby est-il assez rapide ?</a>
  </li>
  <li><a href="#many">Pourquoi tant de tomes ?</a>
  </li>
  <li><a href="#name">D'o&ugrave; vient le nom Kali ?</a>
  </li>
  <li><a href="#student">Je suis &eacute;tudiant en
astronomie. Ceci est-il adapt&eacute; pour moi ?</a>
  </li>
  <li><a href="#astro">Je suis astronome, j'ai
d&eacute;j&agrave; mon doctorat. Ceci est-il adapt&eacute;
pour moi ?</a>
  </li>
  <li><a href="#amateur">Je suis astronome amateur. Ceci
est-il pour moi ?</a>
  </li>
  <li><a href="#help">Comment puis-je me rendre utile ?</a>
  </li>
</ul>
<hr>
<a name="goal"></a><b>Quel
est le but du projet ACS ?
</b>
<p>Notre but &agrave; long
terme est d'&eacute;tablir une communaut&eacute; de
professionnels et amateurs, int&eacute;ress&eacute;s par la
diffusion de la science selon des moyens pratiques, selon une
m&eacute;thodologie librement inspir&eacute;e par les
diff&eacute;rents projets Open-Source tels que le
c&eacute;l&egrave;bre projet Linux.&nbsp;
</p>
<p>La science est d'ailleurs
peut-&ecirc;tre bien le plus ancien et le plus grand projet
open-source de l'histoire. Depuis l'&eacute;poque de
Galil&eacute;e, plus d'une douzaine de
g&eacute;n&eacute;rations de scientifiques ont
travaill&eacute; ensemble pour produire un corps de connaissances
publiques sur le monde naturel qui est unique &agrave; la fois dans
sa pr&eacute;cision et dans le fait qu'il transcende les
barri&egrave;res traditionnelles des cultures et
religions.&nbsp;
</p>
<p>Le projet ACS ambitionne de
rallumer l'esprit des Lumi&egrave;res, o&ugrave; toute personne
&eacute;duqu&eacute;e &eacute;tait invit&eacute;e
&agrave; rejoindre les scientifiques professionnels dans leurs
investigations. Nous avons simplement &eacute;chang&eacute; les
salons traditionnels pour le web, et les exp&eacute;riences sur
table pour des ordinateurs portables.
</p>
<hr><a name="play"></a> <b>Comment
peut-on jouer avec un code N-corps ?</b>
<p>Un moyen rapide de commencer
est de lire notre ouvrage plus ancien <a href="../../../msa/web/index.html">Moving
Stars Around</a>.
Vous y trouverez une introduction compl&egrave;te, en 250 pages,
illustr&eacute;e avec des exemples de code en C++. Depuis les
int&eacute;grateurs tr&egrave;s simples jusqu'au
sch&eacute;ma de Hermite, les lecteurs seront invit&eacute;s
&agrave; effectuer des exp&eacute;riences d'effondrement froid,
&agrave; &eacute;tudier la formation d'&eacute;toiles
doubles et &agrave; adapter les exemples de code &agrave; leurs
propres besoins.
</p>
<p>Une approche plus
d&eacute;taill&eacute;e du travail avec des codes N-corps peut
&ecirc;tre trouv&eacute;e dans notre s&eacute;rie de tomes
sur <a href="../../../kali/index.html">Kali</a>,
puisque nous y d&eacute;veloppons un environnement logiciel de tout
premier plan pour la simulation des syst&egrave;mes stellaires
denses. Ici aussi, nous commen&ccedil;ons de z&eacute;ro,
depuis les int&eacute;grateurs simples pour le probl&egrave;me
&agrave; deux corps, jusqu'&agrave; un large
&eacute;ventail d'int&eacute;grateurs d'ordre
sup&eacute;rieur pour les probl&egrave;mes N-corps
g&eacute;n&eacute;raux.
</p>
<p>&Eacute;tant
donn&eacute; que notre langage de pr&eacute;dilection, le
<a href="http://www.ruby-lang.org/en/">Ruby</a>,
n'est probablement pas familier &agrave; nos lecteurs, les volumes
sur Kali introduisent ce langage en m&ecirc;me temps que les
notions de math&eacute;matiques, physique et informatique
n&eacute;cessaires &agrave; l'&eacute;tude du
probl&egrave;me &agrave; N corps.&nbsp;
</p>
<hr><a name="use"></a> <b>Pourquoi
utiliser le langage Ruby ?</b>
<p>Ruby combine la
flexibilit&eacute; d'un langage de script avec la puissance d'un
langage enti&egrave;rement orient&eacute; objet. Pour un projet
logiciel de grande envergure, tel que le d&eacute;veloppement de <a
 href="../../../kali/index.html">Kali</a>,
il est essentiel d'utiliser l'encapsulation de donn&eacute;es telle
que permise par le C++. Toutefois, en d&eacute;veloppant du nouveau
code il est impossible de savoir &agrave; l'avance quelle structure
de donn&eacute;es sera la plus adapt&eacute;e. Le prototypage
rapide, qui est presqu'impossible en C++, est tout aussi
n&eacute;cessaire pour d&eacute;velopper du code qui soit
&agrave; la fois bien pens&eacute; et facile &agrave; lire,
et non englu&eacute; dans un lourd h&eacute;ritage de
d&eacute;cisions pass&eacute;es.&nbsp;
</p>
<hr><a name="fast"></a> <b>Le
langage Ruby est-il assez rapide ?</b>
<p>Non, le langage Ruby en
lui-m&ecirc;me est trop lent pour des simulations scientifiques
s&eacute;rieuses. Toutefois, il est acceptable de remplacer
quelques lignes critiques en temps de cacul par du code C,
acc&eacute;l&eacute;rant ainsi le code Ruby originel
&agrave; une vitesse approchant celle d'un code C sans trop de
probl&egrave;me. Voir
<a href="../../../kali/vol/vol-6/doc/files/_/_title_ok.html">Vol.
6: Speedup</a> pour des exemples
d&eacute;taill&eacute;s.
</p>
<hr><a name="many"></a> <b>Pourquoi
tant de tomes ?</b>
<p>La plupart des ouvrages
scientifiques r&eacute;sument l'&eacute;tat actuel de la
connaissance dans un domaine &laquo; apr&egrave;s que la
poussi&egrave;re soit retomb&eacute;e &raquo;. Les
&eacute;tudiants se voient pr&eacute;senter un cheminement
logique clair qui pr&eacute;sente peu de ressemblance avec le
processus historique d'essais et d'erreurs qui sous-tend toute
d&eacute;couverte scientifique, grande ou petite. En comparaison,
il y a peu d'information disponible qui enseigne aux
&eacute;tudiants &agrave; faire des erreurs et &agrave;
apprendre d'elles. Notre but est donc au contraire de
pr&eacute;senter l'essentiel de la connaissance tacite qui est
essentielle au lancement d'un projet de recherche en science
calculatoire. <br>
</p>
<p>Initialement, nous pensions
&ecirc;tre capables de pr&eacute;senter notre s&eacute;rie
d'ouvrages en dix volumes. Cependant, lorsque nous avons
achev&eacute; notre premier tome, <i>Moving
Stars Around</i>, et que nous
l'avons publi&eacute; sur le web en octobre 2003, nous avons appris
deux le&ccedil;ons importantes :
1) avant de commencer &agrave; expliciter la connaissance
implicite, on n'a aucune id&eacute;e de l'&eacute;tendue
r&eacute;elle de sa connaissance ; 2) quand on commence ce travail,
on apprend &eacute;norm&eacute;ment,
augmentant l'&eacute;tendue de ses connaissances au fur et
&agrave; mesure qu'on les met par &eacute;crit. Nous
consid&eacute;rons maintenant que plusieurs dizaines de volumes
constituent une estimation plus r&eacute;aliste, et encore ne
parlons-nous ici que de la s&eacute;rie <i>Kali</i>.&nbsp;<br>
</p>
<hr><a name="name"></a> <b>D'o&ugrave;
vient le nom Kali ?</b>
<p>Nous avons emprunt&eacute;
le nom au sanskrit <i>kali</i>,
signifiant <i>sombre</i>,
comme dans l'expression <i>kali
yuga</i>, l'&egrave;re des
t&eacute;n&egrave;bres dans laquelle nous sommes actuellement
selon la mythologie hindoue. Le m&ecirc;me mot appara&icirc;t
dans le nom de la d&eacute;esse hindoue <i>Kali</i>,
d&eacute;crite comme noire. Le terme <i>sombre
</i>semblait appropri&eacute;
pour notre projet, puisque nous nous focalisons sur les aspects tacites
de la connaissance qui n'ont jamais &eacute;t&eacute; mis en
lumi&egrave;re jusque l&agrave; et qui ne peuvent probablement
pas &ecirc;tre pr&eacute;sent&eacute;s par une
s&eacute;rie d'affirmations claire et logique. Nous pensons que nos
dialogues sont plus &agrave; m&ecirc;me de transmettre
l'infinie vari&eacute;t&eacute; de nuances de la connaissance,
moins formelles et moins claires, qui accompagnent toute entreprise. <br>
</p>
<hr><a name="student"></a>
<b>Je suis &eacute;tudiant en
astronomie. Ceci est-il adapt&eacute; pour moi ?<br>
</b>
<p>Et comment ! vous
&ecirc;tes notre cible privil&eacute;gi&eacute;e. Pour tout
dire, nous avons &eacute;crit ces ouvrages avec une version
rajeunie de nous-m&ecirc;me en t&ecirc;te. Nous
esp&eacute;rons que les textes et codes
pr&eacute;sent&eacute;s ici vous seront utiles pour votre
recherche personnelle. Au-del&agrave;, nous esp&eacute;rons que
vous contribuerez vous-m&ecirc;me &agrave; cette
&oelig;uvre par vos additions et variantes : vous &ecirc;tes
invit&eacute;s &agrave; <a href="mailto:comments@artcompsci.org">nous
contacter</a>,
et autant que notre temps le permettra nous t&acirc;cherons de
r&eacute;pondre &agrave; chacun d'entre vous. De plus, vous
serez en mesure de trouver des annonces d'&eacute;coles
d'&eacute;t&eacute; et autres activit&eacute;es
li&eacute;es &agrave; l'ACS sur notre page
d'actualit&eacute;s (<a href="../../../rel/whatsnew.html">"What's New?"</a>).
</p>
<p>Nous vous encourageons
&eacute;galement &agrave; former vos propres groupes de
support, dans lesquels vous partagerez vos exp&eacute;riences de
travail avec le mat&eacute;riel ACS. Vous aurez bien plus de temps
entre vous pour r&eacute;pondre aux questions et suggestions
usuelles que nous ne le pourrons si nous r&eacute;pondons
individuellement &agrave; chacun d'entre vous. Et plus vos
collaborations seront s&eacute;rieuses, plus nous serons
motiv&eacute;s pour vous aider &agrave; impl&eacute;menter
les grandes suggestions que vous ne manquerez pas de nous proposer.
</p>
<hr><a name="astro"></a> <b>Je
suis astronome, j'ai d&eacute;j&agrave; mon doctorat. Ceci
est-il adapt&eacute; pour moi ?<br>
</b>
<p>Oui, si vous avez un quelconque
int&eacute;r&ecirc;t pour les syst&egrave;mes stellaires
denses. Que vous soyez un observateur ou un th&eacute;oricien,
&agrave; partir de 2005 le projet <span style="font-style: italic;">Kali</span>
vous donnera les outils pour lancer des simulations dans un
environnement agr&eacute;able. Notre pr&eacute;sentation est
con&ccedil;ue pour &ecirc;tre auto-contenue, sans
pr&eacute;sumer de connaissances pr&eacute;alables
au-del&agrave; de l'astrophysique de base. Si vous trouviez qu'il
manque quoi que ce soit &agrave; ce propos, veuillez <a
 href="mailto:comments@artcompsci.org">nous contacter</a>.
</p>
<hr><a name="amateur"></a><b>
Je suis astronome amateur. Ceci est-il pour moi ?</b><br>
<p>Bien s&ucirc;r ! Nous
esp&eacute;rons grandement que vous
t&eacute;l&eacute;chargerez notre logiciel, et explorerez les
paradis virtuels sur votre ordinateur, de la m&ecirc;me
fa&ccedil;on que vous explorez les paradis r&eacute;els avec
votre t&eacute;lescope. Nous avons tent&eacute; de
r&eacute;aliser une pr&eacute;sentation auto-contenue. De plus,
nous continuerons &agrave; ajouter des explications et &agrave;
fournir plus de pointeurs vers d'autres sources de savoir pour
compl&eacute;ter l'information d'arri&egrave;re-plan, autant
qu'il sera n&eacute;cessaire.&nbsp;<br>
</p>
<p>Si vous trouvez que des points
cruciaux ne sont pas encore clairement expliqu&eacute;s, ou
manquent, vous &ecirc;tes invit&eacute; &agrave; <a
 href="mailto:comments@artcompsci.org">nous le faire
savoir</a>. Nous ne pourrons
peut-&ecirc;tre pas trouver le temps de vous r&eacute;pondre et
de vous remercier individuellement, mais soyez assur&eacute; que
vos commentaires seront grandement appr&eacute;ci&eacute;s.
</p>
<hr><a name="help"></a> <b>Comment
puis-je me rendre utile ?</b>
<p>Comme nous sommes encore dans
la phase initiale de mise en place du projet ACS, nous portons
principalement notre attention sur l'&eacute;criture d'une
quantit&eacute; suffisante de volumes pour pouvoir pr&eacute;senter un
environnement de simulations N-corps totalement op&eacute;rationnel.
Nous pensons achever cette phase initiale au cours de
l'ann&eacute;e 2005. &Agrave; partir de l&agrave;, il y
aura de plus en plus d'opportunit&eacute;s pour nous rejoindre dans
notre ambition de produire un laboratoire d'astronomie
virtuelle.&nbsp;<br>
</p>
<p>Les diff&eacute;rents
domaines pour le d&eacute;veloppement logiciel iront de domaines
pointus dans l'astronomie calculatoire et les m&eacute;thodes
num&eacute;riques juqu'aux domaines g&eacute;n&eacute;raux
des graphismes et interfaces utilisateurs, ainsi que la
parall&eacute;lisation de code.
En outre, nous aurons besoin de beaucoup d'aide pour porter notre
environnement sur un grand nombre de plate-formes et de
syst&egrave;mes.&nbsp;<br>
</p>
<p>Au fur et &agrave; mesure
que notre projet grandira, nous aurons besoin de volontaires pour
r&eacute;pondre aux questions courantes, et pour aider les
d&eacute;butants &agrave; d&eacute;marrer. De
surcro&icirc;t, il serait tr&egrave;s appr&eacute;ciable de
diposer de traductions de nos textes en d'autres langues que l'anglais.
</p>
<p>Si vous pensez &ecirc;tre
en mesure de vous impliquer s&eacute;rieusement pour nous aider
dans l'un de ces domaines, quel qu'il soit, merci de <a
 href="mailto:comments@artcompsci.org">nous contacter</a>.
</p>
<hr>Retour &agrave; la <a href="../index.html">page d'accueil</a>.
<hr>
<hr>
</body>
</html>

--Apple-Mail-4-746223700
